Revit 2015 API
ViewSheet.GetAllProjectRevisionIds Method
 Gets the ordered array of Revisions which participate in the sheet's revision schedules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015.  Use GetAllRevisionIds() instead.")]
public IList<ElementId> GetAllProjectRevisionIds()
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015.  Use GetAllRevisionIds() instead.")> _
Public Function GetAllProjectRevisionIds As IList(Of ElementId)
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015.  Use GetAllRevisionIds() instead.")]
public:
IList<ElementId^>^ GetAllProjectRevisionIds()
Return Value
 The ordered array of ids of Revisions participating in the sheet's revision schedules.
See Also
ViewSheet Class
Autodesk.Revit.DB Namespace